package com.matsavx.firstfinal.data

object ProductData {

    const val FAKE_NETWORK_DELAY = 500L

    val products = arrayOf(
        Product(
            1,
            "Adidas Dame 6",
            "Мужские баскетбольные кроссовки черно-розового цвета от Дэмиана Лиларда. На легкой шнуровке",
            "https://i.ibb.co/cb8ST5b/5.jpg",
            5199
        ),
        Product(
            2,
            "Nike LeBron 13",
            "Мужкие баскетбольные кроссовки от Леброна Джеймса. Синий фиолетовый и белый цвета. На жесткой шнуровке",
            "https://i.ibb.co/ct8cqX6/2.jpg",
            7890
        ),
        Product(
            3,
            "Nike KD 5 Trey 8",
            "Мужские баскетбольные кроссовки серо-красного цвета от Кевина дюранта. На жесткой шнуровке",
            "https://i.ibb.co/bmmt2Cc/3.jpg",
            7499
        ),
        Product(
            4,
            "Nike PG 3",
            "Мужские баскетбольные кроссовки серого цвета от Пола Джорджа. На лёгкой шнуровке",
            "https://i.ibb.co/GQLPt39/7.jpg",
            8190
        ),
        Product(
            5,
            "Nike Kobe A.D. NXT",
            "Мужкие баскетбольные кроссовки серого цвета от Коби Брайнта. Без шнуровки на застежке-липучке",
            "https://i.ibb.co/20z6TRs/8.jpg",
            11890
        ),
        Product(
            6,
            "Nike Air Jordan 13",
            "Мужские кожаные баскетбольные кроссовки черно-красного цвета от Майкла Джордана. На жесткой шнуровке",
            "https://i.ibb.co/mJX2PKv/6.jpg",
            9999
        ),
        Product(
            7,
            "Under Armour Curry 3",
            "Мужские баскетбольные кроссовки сине-желтого цвета от Стефена Карри. На жесткой шнуровке",
            "https://i.ibb.co/C6wNW4b/4.jpg",
            5999
        ),
        Product(
            8,
            "Nike Kyrie 2",
            "Мужкие баскетбольные кроссовки красно-черного цвета от Кайри Ирвинга. На жесткой шнуровке и застежкой-липучкой",
            "https://i.ibb.co/6DcrTGk/1.jpg",
            6990
        )
    )
}